* LTE opacities
Tarea 4 de Astrofísica Estelar: Atmósferas

+ [[file:LTE%20Opacity.ipynb][jupyter notebook]]
+ [[file:LTE%20Opacity.pdf][PDF export]]
+ [[file:LTE%20Opacity.md][Markdown export]]
** Sync between org <-> markdown <-> jupyter
+ Using the jupytext extension, we can have the ~.ipynb~ file associated with a markdown file, which gets saved automatically.
+ Conversion between markdown and org-mode can be done using ~pandoc~
  + Maybe this could be incorporated into jupytext, but for the moment I do it by hand:
    + From markdown to org-mode:
      #+begin_src sh
        pandoc -f markdown -t org -o 'LTE Opacity.org' 'LTE Opacity.md'
      #+end_src
    + From org-mode to markdown
      + This is more of a pain. Neither pandoc nor org-mode's built-in vanilla markdown exporter do a very good job of writing markdown that jupyter can deal with. Pandoc uses underlining rather than hash symbols for the section headers, which means that jupytext does not split them up into cells.  The vanilla org mode exporter uses indentation instead of triple backticks for the source blocks, so they are not recognized as python by jupytext. 
      + The best bet is ox-gfm, which writes github-flavored markdown, but even this needs some fixes. These are the steps:
        1. Export with ~C-c C-e g o~
        2. The math gets written with latex delimiters ~\( ... \)~, whereas jupyter only understands plain tex syntax: ~$ ... $~
           - The jupyter developers won't fix this since ~\(\)~ conflicts with their markdown syntax
           - So, I post-process with 
             #+begin_src elisp
               (query-replace-regexp "\\\\(\\(.*?\\)\\\\)" "$\\1$" nil nil nil nil nil)
               (query-replace-regexp "\\\\\\[\\(.*?\\)\\\\\\]" "$$\\1$$" nil nil nil nil nil)
             #+end_src
        3. Need to add the following to the top of the file, so that jupytext will do the right thing:
           #+begin_example
             ---
             jupyter:
               jupytext:
                 formats: ipynb,py:light,md
                 text_representation:
                   extension: .md
                   format_name: markdown
                   format_version: '1.2'
                   jupytext_version: 1.3.3
               kernel_info:
                 name: python3
               kernelspec:
                 display_name: Python 3
                 language: python
                 name: python3
             ---
           #+end_example
        4. Use jupytext to write the jupyter notebook
           #+begin_src sh
             jupytext --to notebook Atmos-Tarea04-Enunciado-pandoc.md
           #+end_src
        5. Other little things:
           - You can use non-math-mode subscripts and superscripts in org, which get translated to ~<sub>~ and ~<sup>~ HTML tags in the notebook, *but* jupyter is pretty bad at getting the line spacing right with these, especially in nested lists.  To work around it, for small integers and plus and minus signs, you can use the unicode superscript characters directly.  For instance, insert with ~C-c u~

** Command to export the notebook
#+BEGIN_SRC bash :results verbatim
cd docs
jupyter nbconvert ../*.ipynb
jupyter nbconvert --to pdf ../*.ipynb
ln -s LTE\ Opacity.html index.html
cd -
ls -lR 
#+END_SRC

#+RESULTS:
#+begin_example
/Users/will/Dropbox/Teaching/Estelar/2016-fall/Tarea-04-LTE-Opacity
total 7616
-rw-r--r--@  1 will  staff  1432053 Sep 20 10:43 LTE Opacity.html
-rw-r--r--@  1 will  staff  1329589 Sep 18 22:27 LTE Opacity.ipynb
-rw-r--r--@  1 will  staff    32054 Sep 18 17:54 LTE Opacity.md
-rw-r--r--@  1 will  staff   909441 Sep 20 10:43 LTE Opacity.pdf
drwxr-xr-x@ 20 will  staff      680 Sep 18 17:54 LTE Opacity_files
-rw-r--r--@  1 will  staff     2851 Sep 20 10:45 README.org
drwxr-xr-x@  3 will  staff      102 Sep 14 09:00 __pycache__
-rw-r--r--@  1 will  staff     4587 Sep 20 10:39 dark-jupyter-wjh.css
drwxr-xr-x@  6 will  staff      204 Sep 20 10:55 docs
-rw-r--r--@  1 will  staff     7153 Mar  8  2012 lteopacity.py
-rw-r--r--@  1 will  staff    38664 Sep 16 23:15 test_opacity_a.png
-rw-r--r--@  1 will  staff    44093 Sep 16 23:15 test_opacity_b.png
-rw-r--r--@  1 will  staff    40539 Sep 16 23:15 test_opacity_c.png
-rw-r--r--@  1 will  staff    40201 Sep 16 23:15 test_opacity_d.png

./LTE Opacity_files:
total 1680
-rw-r--r--@ 1 will  staff  57509 Sep 20 10:43 LTE Opacity_22_0.png
-rw-r--r--@ 1 will  staff  70232 Sep 20 10:43 LTE Opacity_24_0.png
-rw-r--r--@ 1 will  staff  46131 Sep 20 10:43 LTE Opacity_36_0.png
-rw-r--r--@ 1 will  staff  76438 Sep 20 10:43 LTE Opacity_41_0.png
-rw-r--r--@ 1 will  staff  28999 Sep 20 10:43 LTE Opacity_50_0.png
-rw-r--r--@ 1 will  staff  39767 Sep 20 10:43 LTE Opacity_52_0.png
-rw-r--r--@ 1 will  staff  29566 Sep 20 10:43 LTE Opacity_58_0.png
-rw-r--r--@ 1 will  staff  32221 Sep 20 10:43 LTE Opacity_59_0.png
-rw-r--r--@ 1 will  staff  22944 Sep 20 10:43 LTE Opacity_62_0.png
-rw-r--r--@ 1 will  staff  36919 Sep 20 10:43 LTE Opacity_68_0.png
-rw-r--r--@ 1 will  staff  47500 Sep 20 10:43 LTE Opacity_73_0.png
-rw-r--r--@ 1 will  staff  50891 Sep 20 10:43 LTE Opacity_77_0.png
-rw-r--r--@ 1 will  staff  44707 Sep 20 10:43 LTE Opacity_84_0.png
-rw-r--r--@ 1 will  staff  51330 Sep 20 10:43 LTE Opacity_87_0.png
-rw-r--r--@ 1 will  staff  45476 Sep 20 10:43 LTE Opacity_90_0.png
-rw-r--r--@ 1 will  staff  39438 Sep 20 10:43 LTE Opacity_93_0.png
-rw-r--r--@ 1 will  staff  46429 Sep 20 10:43 LTE Opacity_96_0.png
-rw-r--r--@ 1 will  staff  49964 Sep 20 10:43 LTE Opacity_98_0.png

./__pycache__:
total 16
-rw-r--r--@ 1 will  staff  6316 Sep 14 09:00 lteopacity.cpython-34.pyc

./docs:
total 4592
-rw-r--r--@  1 will  staff  1432053 Sep 20 10:55 LTE Opacity.html
-rw-r--r--   1 will  staff   909441 Sep 20 10:55 LTE Opacity.pdf
drwxr-xr-x  20 will  staff      680 Sep 20 10:55 LTE Opacity_files
lrwxr-xr-x   1 will  staff       19 Sep 20 10:45 index.html -> ../LTE Opacity.html

./docs/LTE Opacity_files:
total 1680
-rw-r--r--  1 will  staff  57509 Sep 20 10:55 LTE Opacity_22_0.png
-rw-r--r--  1 will  staff  70232 Sep 20 10:55 LTE Opacity_24_0.png
-rw-r--r--  1 will  staff  46131 Sep 20 10:55 LTE Opacity_36_0.png
-rw-r--r--  1 will  staff  76438 Sep 20 10:55 LTE Opacity_41_0.png
-rw-r--r--  1 will  staff  28999 Sep 20 10:55 LTE Opacity_50_0.png
-rw-r--r--  1 will  staff  39767 Sep 20 10:55 LTE Opacity_52_0.png
-rw-r--r--  1 will  staff  29566 Sep 20 10:55 LTE Opacity_58_0.png
-rw-r--r--  1 will  staff  32221 Sep 20 10:55 LTE Opacity_59_0.png
-rw-r--r--  1 will  staff  22944 Sep 20 10:55 LTE Opacity_62_0.png
-rw-r--r--  1 will  staff  36919 Sep 20 10:55 LTE Opacity_68_0.png
-rw-r--r--  1 will  staff  47500 Sep 20 10:55 LTE Opacity_73_0.png
-rw-r--r--  1 will  staff  50891 Sep 20 10:55 LTE Opacity_77_0.png
-rw-r--r--  1 will  staff  44707 Sep 20 10:55 LTE Opacity_84_0.png
-rw-r--r--  1 will  staff  51330 Sep 20 10:55 LTE Opacity_87_0.png
-rw-r--r--  1 will  staff  45476 Sep 20 10:55 LTE Opacity_90_0.png
-rw-r--r--  1 will  staff  39438 Sep 20 10:55 LTE Opacity_93_0.png
-rw-r--r--  1 will  staff  46429 Sep 20 10:55 LTE Opacity_96_0.png
-rw-r--r--  1 will  staff  49964 Sep 20 10:55 LTE Opacity_98_0.png
#+end_example



